In [15]:
import pandas as pd
import numpy as np

### Series and DataFrames

In [16]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

##### was macht pd.date_range("20130101",periods=6)?  
Das macht mir eine Serie von Daten ausgehend aus 20130101  
peridos=6 bedeutet dies Anzahl die Daten

In [17]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
type(df)

pandas.core.frame.DataFrame

### Viewing Data

In [18]:
df.head()

                   A         B         C         D
2013-01-01 -0.062427 -0.434243  0.394097  0.246975
2013-01-02  1.085110  0.650285 -0.620305  0.956321
2013-01-03 -0.663264 -0.207315 -0.061212  2.051860
2013-01-04 -0.547991 -0.525637 -0.554391 -0.100382
2013-01-05  0.557899  1.993498  0.031818 -0.253993

### Selecting

In [19]:
# Select some columns
df["A"]

2013-01-01   -0.062427
2013-01-02    1.085110
2013-01-03   -0.663264
2013-01-04   -0.547991
2013-01-05    0.557899
2013-01-06    0.306830
Freq: D, Name: A, dtype: float64

In [21]:
# to return a dataframe u should use df[[which columns]]
df[["A","B"]]

                   A         B
2013-01-01 -0.062427 -0.434243
2013-01-02  1.085110  0.650285
2013-01-03 -0.663264 -0.207315
2013-01-04 -0.547991 -0.525637
2013-01-05  0.557899  1.993498
2013-01-06  0.306830 -1.073736

Selecting mit Indizes

<span style="color:red">Z</span>uerst die <span style="color:red">Z</span>eilen, <span style="color:red">sp</span>aeter <span style="color:red">Sp</span>alten

In [24]:
# How to select a row with an index
df.loc["2013-01-01"]

A   -0.062427
B   -0.434243
C    0.394097
D    0.246975
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
# to select a row with its index using intger index
df.iloc[0]

A   -0.062427
B   -0.434243
C    0.394097
D    0.246975
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc["2013-01-01",["A","B"]]

A   -0.062427
B   -0.434243
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
# How to show the index of my dataframe
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.sort_values(by="C",inplace=True)

In [31]:
df.index

DatetimeIndex(['2013-01-02', '2013-01-04', '2013-01-06', '2013-01-03',
               '2013-01-05', '2013-01-01'],
              dtype='datetime64[ns]', freq=None)

In [32]:
df

                   A         B         C         D
2013-01-02  1.085110  0.650285 -0.620305  0.956321
2013-01-04 -0.547991 -0.525637 -0.554391 -0.100382
2013-01-06  0.306830 -1.073736 -0.486403  1.188369
2013-01-03 -0.663264 -0.207315 -0.061212  2.051860
2013-01-05  0.557899  1.993498  0.031818 -0.253993
2013-01-01 -0.062427 -0.434243  0.394097  0.246975

In [35]:
df.sort_index(inplace=True)
df

                   A         B         C         D
2013-01-01 -0.062427 -0.434243  0.394097  0.246975
2013-01-02  1.085110  0.650285 -0.620305  0.956321
2013-01-03 -0.663264 -0.207315 -0.061212  2.051860
2013-01-04 -0.547991 -0.525637 -0.554391 -0.100382
2013-01-05  0.557899  1.993498  0.031818 -0.253993
2013-01-06  0.306830 -1.073736 -0.486403  1.188369

### Boolean Masks

In [48]:
df>0

                A      B      C      D
2013-01-01  False  False   True   True
2013-01-02   True   True  False   True
2013-01-03  False  False  False   True
2013-01-04  False  False  False  False
2013-01-05   True   True   True  False
2013-01-06   True  False  False   True

In [54]:
# Neue Spalte hinzufügen
df["E"]=list("ABCDEF")
df

                   A         B         C         D  E
2013-01-01 -0.062427 -0.434243  0.394097  0.246975  A
2013-01-02  1.085110  0.650285 -0.620305  0.956321  B
2013-01-03 -0.663264 -0.207315 -0.061212  2.051860  C
2013-01-04 -0.547991 -0.525637 -0.554391 -0.100382  D
2013-01-05  0.557899  1.993498  0.031818 -0.253993  E
2013-01-06  0.306830 -1.073736 -0.486403  1.188369  F

In [55]:
df["E"].isin(["A","B"])

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Name: E, dtype: bool

In [57]:
df.E.isin(list("ABC"))

2013-01-01     True
2013-01-02     True
2013-01-03     True
2013-01-04    False
2013-01-05    False
2013-01-06    False
Name: E, dtype: bool

### Neue Werte setzen

In [41]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

### Fehlende Werte

### Eigene Transformationen

### Verkleben

In [54]:
# Untereinander kleben mit concat
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:3], df[3:7], df[7:]]

In [58]:
# merge ist die pandas version von sql join
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [60]:
# left joins gehen auch
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar", "blu"], "rval": [4, 5, 6]})

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [62]:
# inner joins gehen auch
left = pd.DataFrame({"key": ["foo", "bar", "bla"], "lval": [1, 2, 3]})
right = pd.DataFrame({"key": ["foo", "bar", "blu"], "rval": [4, 5, 6]})

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Group by

In [63]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

### Schmaler machen

In [70]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df

                     A         B
first second
bar   one    -1.401062  0.149005
      two    -0.750244  0.018133
baz   one    -0.999222  0.371569
      two     0.474806  1.115227
foo   one    -0.984754  0.378121
      two    -1.092887  1.089937
qux   one    -0.261627 -0.116730
      two     0.797584  1.557293

In [77]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
cols = pd.MultiIndex.from_tuples([('A', 'C'), ('A', 'D')])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=cols)
df

                     A
                     C         D
first second
bar   one     0.687274  0.852420
      two     2.635738  1.414812
baz   one     0.879718  0.348400
      two    -0.706858  0.166932
foo   one    -0.446378  0.452216
      two    -0.491160 -0.654348
qux   one     0.015336 -0.403691
      two    -0.836063  0.522055

### Pivotisieren

In [90]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  0.761077 -0.606681
1     one  B  foo -0.356042  0.474504
2     two  C  foo  1.046916 -0.483352
3   three  A  bar  1.408728 -0.406593
4     one  B  bar -1.205208 -0.098778
5     one  C  bar  0.943586  1.799701
6     two  A  foo  0.423332  0.126558
7   three  B  foo -2.854732  0.616204
8     one  C  foo  0.623106  1.787913
9     one  A  bar  0.709951 -0.663115
10    two  B  bar  0.026964  0.516002
11  three  C  bar  0.351451  0.354875

### Kategorische Variablen

In [13]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [14]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e